Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxRif_bf.h
/** \brief Offset for Ifx_RIF_IPI_Bits.EN3 */
#define IFX_RIF_IPI_EN3_OFF (19u)

/** \brief Length for Ifx_RIF_IPI_Bits.SDDV */
#define IFX_RIF_IPI_SDDV_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.SDDV */
#define IFX_RIF_IPI_SDDV_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.SDDV */
#define IFX_RIF_IPI_SDDV_OFF (31u)

/** \brief Length for Ifx_RIF_FLM_Bits.MODE */
#define IFX_RIF_FLM_MODE_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.MODE */
#define IFX_RIF_FLM_MODE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.MODE */
#define IFX_RIF_FLM_MODE_OFF (0u)

/** \brief Length for Ifx_RIF_FLM_Bits.FSWP */
#define IFX_RIF_FLM_FSWP_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.FSWP */
#define IFX_RIF_FLM_FSWP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.FSWP */
#define IFX_RIF_FLM_FSWP_OFF (1u)

/** \brief Length for Ifx_RIF_FLM_Bits.CRCEN */
#define IFX_RIF_FLM_CRCEN_LEN (1u)

/** \brief Mask for Ifx_RIF_FLM_Bits.CRCEN */
#define IFX_RIF_FLM_CRCEN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLM_Bits.CRCEN */
#define IFX_RIF_FLM_CRCEN_OFF (8u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF0 */
#define IFX_RIF_DMI_ENF0_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF0 */
#define IFX_RIF_DMI_ENF0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF0 */
#define IFX_RIF_DMI_ENF0_OFF (0u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF1 */
#define IFX_RIF_DMI_ENF1_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF1 */
#define IFX_RIF_DMI_ENF1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF1 */
#define IFX_RIF_DMI_ENF1_OFF (1u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF2 */
#define IFX_RIF_DMI_ENF2_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF2 */
#define IFX_RIF_DMI_ENF2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF2 */
#define IFX_RIF_DMI_ENF2_OFF (2u)

/** \brief Length for Ifx_RIF_DMI_Bits.ENF3 */
#define IFX_RIF_DMI_ENF3_LEN (1u)

/** \brief Mask for Ifx_RIF_DMI_Bits.ENF3 */
#define IFX_RIF_DMI_ENF3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DMI_Bits.ENF3 */
#define IFX_RIF_DMI_ENF3_OFF (3u)

/** \brief Length for Ifx_RIF_RSM0_Bits.R1 */
#define IFX_RIF_RSM0_R1_LEN (4u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.R1 */
#define IFX_RIF_RSM0_R1_MSK (0xfu)

/** \brief Offset for Ifx_RIF_RSM0_Bits.R1 */
#define IFX_RIF_RSM0_R1_OFF (0u)

/** \brief Length for Ifx_RIF_RSM0_Bits.R3 */
#define IFX_RIF_RSM0_R3_LEN (4u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.R3 */
#define IFX_RIF_RSM0_R3_MSK (0xfu)

/** \brief Offset for Ifx_RIF_RSM0_Bits.R3 */
#define IFX_RIF_RSM0_R3_OFF (8u)

/** \brief Length for Ifx_RIF_RSM0_Bits.WAIT */
#define IFX_RIF_RSM0_WAIT_LEN (4u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.WAIT */
#define IFX_RIF_RSM0_WAIT_MSK (0xfu)

/** \brief Offset for Ifx_RIF_RSM0_Bits.WAIT */
#define IFX_RIF_RSM0_WAIT_OFF (12u)

/** \brief Length for Ifx_RIF_RSM0_Bits.PAUSE */
#define IFX_RIF_RSM0_PAUSE_LEN (4u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.PAUSE */
#define IFX_RIF_RSM0_PAUSE_MSK (0xfu)

/** \brief Offset for Ifx_RIF_RSM0_Bits.PAUSE */
#define IFX_RIF_RSM0_PAUSE_OFF (16u)

/** \brief Length for Ifx_RIF_RSM0_Bits.PRE */
#define IFX_RIF_RSM0_PRE_LEN (6u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.PRE */
#define IFX_RIF_RSM0_PRE_MSK (0x3fu)

/** \brief Offset for Ifx_RIF_RSM0_Bits.PRE */
#define IFX_RIF_RSM0_PRE_OFF (24u)

/** \brief Length for Ifx_RIF_RSM0_Bits.LCKSTP */
#define IFX_RIF_RSM0_LCKSTP_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.LCKSTP */
#define IFX_RIF_RSM0_LCKSTP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM0_Bits.LCKSTP */
#define IFX_RIF_RSM0_LCKSTP_OFF (30u)

/** \brief Length for Ifx_RIF_RSM0_Bits.INTADC */
#define IFX_RIF_RSM0_INTADC_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM0_Bits.INTADC */
#define IFX_RIF_RSM0_INTADC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM0_Bits.INTADC */
#define IFX_RIF_RSM0_INTADC_OFF (31u)

/** \brief Length for Ifx_RIF_RSM1_Bits.RAMPS */
#define IFX_RIF_RSM1_RAMPS_LEN (11u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.RAMPS */
#define IFX_RIF_RSM1_RAMPS_MSK (0x7ffu)

/** \brief Offset for Ifx_RIF_RSM1_Bits.RAMPS */
#define IFX_RIF_RSM1_RAMPS_OFF (0u)

/** \brief Length for Ifx_RIF_RSM1_Bits.C1SEL */
#define IFX_RIF_RSM1_C1SEL_LEN (2u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.C1SEL */
#define IFX_RIF_RSM1_C1SEL_MSK (0x3u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.C1SEL */
#define IFX_RIF_RSM1_C1SEL_OFF (12u)

/** \brief Length for Ifx_RIF_RSM1_Bits.R1SEL */
#define IFX_RIF_RSM1_R1SEL_LEN (2u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.R1SEL */
#define IFX_RIF_RSM1_R1SEL_MSK (0x3u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.R1SEL */
#define IFX_RIF_RSM1_R1SEL_OFF (14u)

/** \brief Length for Ifx_RIF_RSM1_Bits.CURRAMP */
#define IFX_RIF_RSM1_CURRAMP_LEN (12u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.CURRAMP */
#define IFX_RIF_RSM1_CURRAMP_MSK (0xfffu)

/** \brief Offset for Ifx_RIF_RSM1_Bits.CURRAMP */
#define IFX_RIF_RSM1_CURRAMP_OFF (16u)

/** \brief Length for Ifx_RIF_RSM1_Bits.C1POL */
#define IFX_RIF_RSM1_C1POL_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.C1POL */
#define IFX_RIF_RSM1_C1POL_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.C1POL */
#define IFX_RIF_RSM1_C1POL_OFF (28u)

/** \brief Length for Ifx_RIF_RSM1_Bits.R1POL */
#define IFX_RIF_RSM1_R1POL_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.R1POL */
#define IFX_RIF_RSM1_R1POL_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.R1POL */
#define IFX_RIF_RSM1_R1POL_OFF (29u)

/** \brief Length for Ifx_RIF_RSM1_Bits.C1EN */
#define IFX_RIF_RSM1_C1EN_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.C1EN */
#define IFX_RIF_RSM1_C1EN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.C1EN */
#define IFX_RIF_RSM1_C1EN_OFF (30u)

/** \brief Length for Ifx_RIF_RSM1_Bits.R1EN */
#define IFX_RIF_RSM1_R1EN_LEN (1u)

/** \brief Mask for Ifx_RIF_RSM1_Bits.R1EN */
#define IFX_RIF_RSM1_R1EN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_RSM1_Bits.R1EN */
#define IFX_RIF_RSM1_R1EN_OFF (31u)

/** \brief Length for Ifx_RIF_RSM2_Bits.SAMPLES */
#define IFX_RIF_RSM2_SAMPLES_LEN (11u)

/** \brief Mask for Ifx_RIF_RSM2_Bits.SAMPLES */
#define IFX_RIF_RSM2_SAMPLES_MSK (0x7ffu)

