Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxRif_bf.h
/** \brief Offset for Ifx_RIF_RSM2_Bits.SAMPLES */
#define IFX_RIF_RSM2_SAMPLES_OFF (0u)

/** \brief Length for Ifx_RIF_RSM2_Bits.CURSAMPLE */
#define IFX_RIF_RSM2_CURSAMPLE_LEN (12u)

/** \brief Mask for Ifx_RIF_RSM2_Bits.CURSAMPLE */
#define IFX_RIF_RSM2_CURSAMPLE_MSK (0xfffu)

/** \brief Offset for Ifx_RIF_RSM2_Bits.CURSAMPLE */
#define IFX_RIF_RSM2_CURSAMPLE_OFF (16u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CALE */
#define IFX_RIF_INTCON_CALE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CALE */
#define IFX_RIF_INTCON_CALE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CALE */
#define IFX_RIF_INTCON_CALE_OFF (0u)

/** \brief Length for Ifx_RIF_INTCON_Bits.FWE */
#define IFX_RIF_INTCON_FWE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.FWE */
#define IFX_RIF_INTCON_FWE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.FWE */
#define IFX_RIF_INTCON_FWE_OFF (1u)

/** \brief Length for Ifx_RIF_INTCON_Bits.REE */
#define IFX_RIF_INTCON_REE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.REE */
#define IFX_RIF_INTCON_REE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.REE */
#define IFX_RIF_INTCON_REE_OFF (2u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CEE */
#define IFX_RIF_INTCON_CEE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CEE */
#define IFX_RIF_INTCON_CEE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CEE */
#define IFX_RIF_INTCON_CEE_OFF (3u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE0 */
#define IFX_RIF_INTCON_CRCE0_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE0 */
#define IFX_RIF_INTCON_CRCE0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE0 */
#define IFX_RIF_INTCON_CRCE0_OFF (4u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE1 */
#define IFX_RIF_INTCON_CRCE1_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE1 */
#define IFX_RIF_INTCON_CRCE1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE1 */
#define IFX_RIF_INTCON_CRCE1_OFF (5u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE2 */
#define IFX_RIF_INTCON_CRCE2_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE2 */
#define IFX_RIF_INTCON_CRCE2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE2 */
#define IFX_RIF_INTCON_CRCE2_OFF (6u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCE3 */
#define IFX_RIF_INTCON_CRCE3_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCE3 */
#define IFX_RIF_INTCON_CRCE3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCE3 */
#define IFX_RIF_INTCON_CRCE3_OFF (7u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1EE */
#define IFX_RIF_INTCON_R1EE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.R1EE */
#define IFX_RIF_INTCON_R1EE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1EE */
#define IFX_RIF_INTCON_R1EE_OFF (8u)

/** \brief Length for Ifx_RIF_INTCON_Bits.C1EE */
#define IFX_RIF_INTCON_C1EE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.C1EE */
#define IFX_RIF_INTCON_C1EE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.C1EE */
#define IFX_RIF_INTCON_C1EE_OFF (9u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1SE */
#define IFX_RIF_INTCON_R1SE_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.R1SE */
#define IFX_RIF_INTCON_R1SE_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1SE */
#define IFX_RIF_INTCON_R1SE_OFF (10u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CALF */
#define IFX_RIF_INTCON_CALF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CALF */
#define IFX_RIF_INTCON_CALF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CALF */
#define IFX_RIF_INTCON_CALF_OFF (16u)

/** \brief Length for Ifx_RIF_INTCON_Bits.FWF */
#define IFX_RIF_INTCON_FWF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.FWF */
#define IFX_RIF_INTCON_FWF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.FWF */
#define IFX_RIF_INTCON_FWF_OFF (17u)

/** \brief Length for Ifx_RIF_INTCON_Bits.REF */
#define IFX_RIF_INTCON_REF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.REF */
#define IFX_RIF_INTCON_REF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.REF */
#define IFX_RIF_INTCON_REF_OFF (18u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CEF */
#define IFX_RIF_INTCON_CEF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CEF */
#define IFX_RIF_INTCON_CEF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CEF */
#define IFX_RIF_INTCON_CEF_OFF (19u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF0 */
#define IFX_RIF_INTCON_CRCF0_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF0 */
#define IFX_RIF_INTCON_CRCF0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF0 */
#define IFX_RIF_INTCON_CRCF0_OFF (20u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF1 */
#define IFX_RIF_INTCON_CRCF1_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF1 */
#define IFX_RIF_INTCON_CRCF1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF1 */
#define IFX_RIF_INTCON_CRCF1_OFF (21u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF2 */
#define IFX_RIF_INTCON_CRCF2_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF2 */
#define IFX_RIF_INTCON_CRCF2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF2 */
#define IFX_RIF_INTCON_CRCF2_OFF (22u)

/** \brief Length for Ifx_RIF_INTCON_Bits.CRCF3 */
#define IFX_RIF_INTCON_CRCF3_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.CRCF3 */
#define IFX_RIF_INTCON_CRCF3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.CRCF3 */
#define IFX_RIF_INTCON_CRCF3_OFF (23u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1EF */
#define IFX_RIF_INTCON_R1EF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.R1EF */
#define IFX_RIF_INTCON_R1EF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1EF */
#define IFX_RIF_INTCON_R1EF_OFF (24u)

/** \brief Length for Ifx_RIF_INTCON_Bits.C1EF */
#define IFX_RIF_INTCON_C1EF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.C1EF */
#define IFX_RIF_INTCON_C1EF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.C1EF */
#define IFX_RIF_INTCON_C1EF_OFF (25u)

/** \brief Length for Ifx_RIF_INTCON_Bits.R1SF */
#define IFX_RIF_INTCON_R1SF_LEN (1u)

/** \brief Mask for Ifx_RIF_INTCON_Bits.R1SF */
#define IFX_RIF_INTCON_R1SF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_INTCON_Bits.R1SF */
#define IFX_RIF_INTCON_R1SF_OFF (26u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CALS */
#define IFX_RIF_FLAGSSET_CALS_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CALS */
#define IFX_RIF_FLAGSSET_CALS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CALS */
#define IFX_RIF_FLAGSSET_CALS_OFF (16u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.FWS */
#define IFX_RIF_FLAGSSET_FWS_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.FWS */
#define IFX_RIF_FLAGSSET_FWS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.FWS */
#define IFX_RIF_FLAGSSET_FWS_OFF (17u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.RES */
#define IFX_RIF_FLAGSSET_RES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.RES */
#define IFX_RIF_FLAGSSET_RES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.RES */
#define IFX_RIF_FLAGSSET_RES_OFF (18u)

