Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxRif_bf.h
/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CES */
#define IFX_RIF_FLAGSSET_CES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CES */
#define IFX_RIF_FLAGSSET_CES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CES */
#define IFX_RIF_FLAGSSET_CES_OFF (19u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS0 */
#define IFX_RIF_FLAGSSET_CRCS0_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS0 */
#define IFX_RIF_FLAGSSET_CRCS0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS0 */
#define IFX_RIF_FLAGSSET_CRCS0_OFF (20u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS1 */
#define IFX_RIF_FLAGSSET_CRCS1_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS1 */
#define IFX_RIF_FLAGSSET_CRCS1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS1 */
#define IFX_RIF_FLAGSSET_CRCS1_OFF (21u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS2 */
#define IFX_RIF_FLAGSSET_CRCS2_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS2 */
#define IFX_RIF_FLAGSSET_CRCS2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS2 */
#define IFX_RIF_FLAGSSET_CRCS2_OFF (22u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.CRCS3 */
#define IFX_RIF_FLAGSSET_CRCS3_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.CRCS3 */
#define IFX_RIF_FLAGSSET_CRCS3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.CRCS3 */
#define IFX_RIF_FLAGSSET_CRCS3_OFF (23u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.R1ES */
#define IFX_RIF_FLAGSSET_R1ES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.R1ES */
#define IFX_RIF_FLAGSSET_R1ES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.R1ES */
#define IFX_RIF_FLAGSSET_R1ES_OFF (24u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.C1ES */
#define IFX_RIF_FLAGSSET_C1ES_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.C1ES */
#define IFX_RIF_FLAGSSET_C1ES_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.C1ES */
#define IFX_RIF_FLAGSSET_C1ES_OFF (25u)

/** \brief Length for Ifx_RIF_FLAGSSET_Bits.R1SS */
#define IFX_RIF_FLAGSSET_R1SS_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSSET_Bits.R1SS */
#define IFX_RIF_FLAGSSET_R1SS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSSET_Bits.R1SS */
#define IFX_RIF_FLAGSSET_R1SS_OFF (26u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CALC */
#define IFX_RIF_FLAGSCL_CALC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CALC */
#define IFX_RIF_FLAGSCL_CALC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CALC */
#define IFX_RIF_FLAGSCL_CALC_OFF (16u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_OFF (17u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_OFF (18u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CEC */
#define IFX_RIF_FLAGSCL_CEC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CEC */
#define IFX_RIF_FLAGSCL_CEC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CEC */
#define IFX_RIF_FLAGSCL_CEC_OFF (19u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_OFF (20u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_OFF (21u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_OFF (22u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_OFF (23u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_OFF (24u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.C1EC */
#define IFX_RIF_FLAGSCL_C1EC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.C1EC */
#define IFX_RIF_FLAGSCL_C1EC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.C1EC */
#define IFX_RIF_FLAGSCL_C1EC_OFF (25u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_OFF (26u)

/** \brief Length for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_LEN (10u)

/** \brief Mask for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_MSK (0x3ffu)

/** \brief Offset for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_OFF (0u)

/** \brief Length for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_OFF (0u)

/** \brief Length for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_OFF (1u)

/** \brief Length for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_MSK (0x1u)

