Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxRif_bf.h
/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.DDLY3 */
#define IFX_RIF_DBGDLY1_DDLY3_OFF (20u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.BMDLY0 */
#define IFX_RIF_DBGDLY1_BMDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.BMDLY0 */
#define IFX_RIF_DBGDLY1_BMDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.BMDLY0 */
#define IFX_RIF_DBGDLY1_BMDLY0_OFF (24u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.BMDLY1 */
#define IFX_RIF_DBGDLY1_BMDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.BMDLY1 */
#define IFX_RIF_DBGDLY1_BMDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.BMDLY1 */
#define IFX_RIF_DBGDLY1_BMDLY1_OFF (28u)

/** \brief Length for Ifx_RIF_DBG0_Bits.DD1 */
#define IFX_RIF_DBG0_DD1_LEN (16u)

/** \brief Mask for Ifx_RIF_DBG0_Bits.DD1 */
#define IFX_RIF_DBG0_DD1_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG0_Bits.DD1 */
#define IFX_RIF_DBG0_DD1_OFF (0u)

/** \brief Length for Ifx_RIF_DBG0_Bits.DD2 */
#define IFX_RIF_DBG0_DD2_LEN (16u)

/** \brief Mask for Ifx_RIF_DBG0_Bits.DD2 */
#define IFX_RIF_DBG0_DD2_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG0_Bits.DD2 */
#define IFX_RIF_DBG0_DD2_OFF (16u)

/** \brief Length for Ifx_RIF_DBG1_Bits.DD3 */
#define IFX_RIF_DBG1_DD3_LEN (16u)

/** \brief Mask for Ifx_RIF_DBG1_Bits.DD3 */
#define IFX_RIF_DBG1_DD3_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG1_Bits.DD3 */
#define IFX_RIF_DBG1_DD3_OFF (0u)

/** \brief Length for Ifx_RIF_DBG1_Bits.DD4 */
#define IFX_RIF_DBG1_DD4_LEN (16u)

/** \brief Mask for Ifx_RIF_DBG1_Bits.DD4 */
#define IFX_RIF_DBG1_DD4_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG1_Bits.DD4 */
#define IFX_RIF_DBG1_DD4_OFF (16u)

/** \brief Length for Ifx_RIF_OCS_Bits.TGS */
#define IFX_RIF_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_RIF_OCS_Bits.TGS */
#define IFX_RIF_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_RIF_OCS_Bits.TGS */
#define IFX_RIF_OCS_TGS_OFF (0u)

/** \brief Length for Ifx_RIF_OCS_Bits.TGB */
#define IFX_RIF_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.TGB */
#define IFX_RIF_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.TGB */
#define IFX_RIF_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_RIF_OCS_Bits.TG_P */
#define IFX_RIF_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.TG_P */
#define IFX_RIF_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.TG_P */
#define IFX_RIF_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_RIF_OCS_Bits.SUS */
#define IFX_RIF_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_RIF_OCS_Bits.SUS */
#define IFX_RIF_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_RIF_OCS_Bits.SUS */
#define IFX_RIF_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_RIF_OCS_Bits.SUS_P */
#define IFX_RIF_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.SUS_P */
#define IFX_RIF_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.SUS_P */
#define IFX_RIF_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_RIF_OCS_Bits.SUSSTA */
#define IFX_RIF_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.SUSSTA */
#define IFX_RIF_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.SUSSTA */
#define IFX_RIF_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_RIF_KRSTCLR_Bits.CLR */
#define IFX_RIF_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_RIF_KRSTCLR_Bits.CLR */
#define IFX_RIF_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRSTCLR_Bits.CLR */
#define IFX_RIF_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_RIF_KRST1_Bits.RST */
#define IFX_RIF_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_RIF_KRST1_Bits.RST */
#define IFX_RIF_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRST1_Bits.RST */
#define IFX_RIF_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_RIF_KRST0_Bits.RST */
#define IFX_RIF_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_RIF_KRST0_Bits.RST */
#define IFX_RIF_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRST0_Bits.RST */
#define IFX_RIF_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_RIF_KRST0_Bits.RSTSTAT */
#define IFX_RIF_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_RIF_KRST0_Bits.RSTSTAT */
#define IFX_RIF_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRST0_Bits.RSTSTAT */
#define IFX_RIF_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN0 */
#define IFX_RIF_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN0 */
#define IFX_RIF_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN0 */
#define IFX_RIF_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN1 */
#define IFX_RIF_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN1 */
#define IFX_RIF_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN1 */
#define IFX_RIF_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN2 */
#define IFX_RIF_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN2 */
#define IFX_RIF_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN2 */
#define IFX_RIF_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN3 */
#define IFX_RIF_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN3 */
#define IFX_RIF_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN3 */
#define IFX_RIF_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN4 */
#define IFX_RIF_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN4 */
#define IFX_RIF_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN4 */
#define IFX_RIF_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN5 */
#define IFX_RIF_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN5 */
#define IFX_RIF_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN5 */
#define IFX_RIF_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN6 */
#define IFX_RIF_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN6 */
#define IFX_RIF_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN6 */
#define IFX_RIF_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN7 */
#define IFX_RIF_ACCEN0_EN7_LEN (1u)

